# SQL Cheat Sheet
- SELECT  |  DICTINCT  |  COUNT
- FILTER : WHERE  |  BETWEEN  |  IN |  IS NULL  |  IS NOT NULL  |  LIKE

___

## 0. Loading Database

In [1]:
%reload_ext sql

In [2]:
%%sql
postgresql://localhost/films

'Connected: @films'

___

## 1. Database Tables

In [3]:
%%sql 
-- Replace films whichever table (people/reviews/roles) you would like to see

SELECT * FROM films LIMIT 1;

 * postgresql://localhost/films
1 rows affected.

[(1, "Intolerance: Love's Struggle Throughout the Ages", 1916, 'USA', 123, None, 'Not Rated', None, 385907)]

___

## 2. SELECT

- #### Select AS

In [7]:
%%sql
SELECT ' Any string here' AS RESULT;

 * postgresql://localhost/films
1 rows affected.

[(' Any string here',)]

- #### Selecting Single Columms

In [8]:
%%sql
SELECT title FROM films LIMIT 2;

 * postgresql://localhost/films
2 rows affected.

[("Intolerance: Love's Struggle Throughout the Ages",),
 ('Over the Hill to the Poorhouse',)]

- #### Selecting Multple Columns

In [66]:
%%sql
SELECT title, release_year, country FROM films LIMIT 2;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
2 rows affected.

[("Intolerance: Love's Struggle Throughout the Ages", 1916, 'USA'),
 ('Over the Hill to the Poorhouse', 1920, 'USA')]

- #### LIMIT
-Select the first n number of rows

In [14]:
%%sql
SELECT * FROM films LIMIT 2;

 * postgresql://localhost/films
2 rows affected.

[(1, "Intolerance: Love's Struggle Throughout the Ages", 1916, 'USA', 123, None, 'Not Rated', None, 385907),
 (2, 'Over the Hill to the Poorhouse', 1920, 'USA', 110, None, None, 3000000, 100000)]

___

## 3. DISTINCT
- Select unique values from a column with duplicate values

In [13]:
%%sql
SELECT DISTINCT country FROM films LIMIT 3;

 * postgresql://localhost/films
3 rows affected.

[(None,), ('Soviet Union',), ('Indonesia',)]

___

## 4. COUNT
- Count number of entries in a column
- Apply any filtering conditions as desired

In [15]:
%%sql
SELECT COUNT(*) FROM films;

 * postgresql://localhost/films
1 rows affected.

[(4968,)]

In [16]:
%%sql
--- returns the count of all the non-null language entries
SELECT COUNT(language) FROM films

 * postgresql://localhost/films
1 rows affected.

[(4957,)]

In [76]:
%%sql
SELECT COUNT(DISTINCT country) FROM films;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
1 rows affected.

[(64,)]

___

## 4. WHERE
- = equal
- <> not equal
- < less than
- '>' greater than
- <= less than or equal to
- '>=' greater than or equal to

In [104]:
%%sql
SELECT * FROM films
WHERE release_year = 2016 LIMIT 3;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
3 rows affected.

[(4821, '10 Cloverfield Lane', 2016, 'USA', 104, 'English', 'PG-13', 71897215, 15000000),
 (4822, '13 Hours', 2016, 'USA', 144, 'English', 'R', 52822418, 50000000),
 (4823, "A Beginner's Guide to Snuff", 2016, 'USA', 87, 'English', None, None, None)]

In [103]:
%%sql
SELECT * FROM films
WHERE release_year < 2000  LIMIT 3;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
3 rows affected.

[(1, "Intolerance: Love's Struggle Throughout the Ages", 1916, 'USA', 123, None, 'Not Rated', None, 385907),
 (2, 'Over the Hill to the Poorhouse', 1920, 'USA', 110, None, None, 3000000, 100000),
 (3, 'The Big Parade', 1925, 'USA', 151, None, 'Not Rated', None, 245000)]

In [92]:
%%sql
SELECT * FROM people
WHERE birthdate = '1974-11-11';

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
1 rows affected.

[(4792, 'Leonardo DiCaprio', datetime.date(1974, 11, 11), None)]

In [97]:
%%sql
SELECT title, country FROM films
WHERE gross = '26435';

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
1 rows affected.

[('Metropolis', 'Germany')]

- #### WHERE & COUNT

In [91]:
%%sql
SELECT COUNT(*) FROM films
WHERE release_year <> 2000;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
1 rows affected.

[(4755,)]

In [99]:
%%sql
SELECT COUNT(*)FROM films
WHERE language = 'Hindi';

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
1 rows affected.

[(28,)]

___

## 5. AND
- Select data based on multiple conditions

In [17]:
%%sql
SELECT title, release_year FROM films
WHERE release_year > 2000
AND release_year < 2010
AND language =  'Spanish' LIMIT 3;

 * postgresql://localhost/films
3 rows affected.

[('Y Tu Mamá También', 2001),
 ('El crimen del padre Amaro', 2002),
 ('Mondays in the Sun', 2002)]

___

## 6. OR
- Select data based on some conditions

In [18]:
%%sql
SELECT title, release_year FROM films
WHERE release_year >=1990
AND release_year < 2000
AND (language = 'French' OR language = 'Spanish')
And gross > 2000000;

 * postgresql://localhost/films
2 rows affected.

[('El Mariachi', 1992), ('The Red Violin', 1998)]

___

## 7.  BETWEEN
- Shorthand for filtering between a range
- BETWEEN is inclusive
- i.e. BETWEEN 1990 and 1995 is 1990 - 1995

In [20]:
%%sql
SELECT title, release_year FROM films
WHERE release_year BETWEEN 1990 AND 1999
AND (language = 'French' OR language = 'Spanish')
AND gross > 2000000;

 * postgresql://localhost/films
2 rows affected.

[('El Mariachi', 1992), ('The Red Violin', 1998)]

___

## 8. IN
- Filter (OR) based on multiple conditions
- Where country is US OR Germany

In [21]:
%%sql
SELECT title, country FROM films
WHERE country IN('USA', 'Germany') 
AND duration > 120 LIMIT 5;

 * postgresql://localhost/films
5 rows affected.

[("Intolerance: Love's Struggle Throughout the Ages", 'USA'),
 ('The Big Parade', 'USA'),
 ('Metropolis', 'Germany'),
 ("You Can't Take It with You", 'USA'),
 ('Gone with the Wind', 'USA')]

In [22]:
%%sql
SELECT title, certification FROM films
WHERE certification IN('NC-17', 'R') LIMIT 5;

 * postgresql://localhost/films
5 rows affected.

[('Psycho', 'R'),
 ('A Fistful of Dollars', 'R'),
 ("Rosemary's Baby", 'R'),
 ('Mississippi Mermaid', 'R'),
 ('The Wild Bunch', 'R')]

___

## 9. NULL | IS NULL | IS NOT NULL
- NULL represents a missing or unknown value
- using WHERE & IS NULL one can figure out where data is missing

In [144]:
%%sql
SELECT * FROM people
WHERE birthdate IS NULL LIMIT 5;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
5 rows affected.

[(3, 'A. Raven Cruz', None, None),
 (5, 'A.J. DeLucia', None, None),
 (9, 'Aaron Hann', None, None),
 (11, 'Aaron Hughes', None, None),
 (13, 'Aaron Schneider', None, None)]

In [4]:
%%sql
-- names of people alive
SELECT name FROM people
WHERE deathdate IS NOT NULL LIMIT 5;

 * postgresql://localhost/films
5 rows affected.

[('Aaliyah',),
 ('Adolphe Menjou',),
 ('Adrian Gonzalez',),
 ('Adriana Caselotti',),
 ('Adrienne Shelly',)]

In [147]:
%%sql
-- titles of movies with no budget
SELECT title FROM films
WHERE budget IS NULL LIMIT 5;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
5 rows affected.

[("Pandora's Box",),
 ('The Prisoner of Zenda',),
 ('The Blue Bird',),
 ('Bambi',),
 ('State Fair',)]

In [149]:
%%sql
-- number of movies with no language associated 
SELECT COUNT(*) FROM films
WHERE language IS NULL;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
1 rows affected.

[(11,)]

___

## 10. LIKE & NOT LIKE
- In SQL, the LIKE operator can be used in a WHERE clause to search for a pattern in a column.

- The % wildcard will match zero, one, or many characters in text. For example, the following query matches companies like 'Data', 'DataC' 'DataCamp', 'DataMind', and so on:

>SELECT name FROM companies
>WHERE name LIKE 'Data%';

- The _ wildcard will match a single character. For example, the following query matches companies like 'DataCamp', 'DataComp', and so on:

>SELECT name
FROM companies
WHERE name LIKE 'DataC_mp%';

In [160]:
%%sql
-- Get the names of all people whose names begin with 'B'
SELECT name FROM people
WHERE name LIKE 'B%' LIMIT 5;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
5 rows affected.

[('B.J. Novak',),
 ('Babak Najafi',),
 ('Babar Ahmed',),
 ('Bahare Seddiqi',),
 ('Bai Ling',)]

In [170]:
%%sql
-- Get the names of all people whose names have 'r' as the second letter
SELECT name FROM people
WHERE name LIKE '_r%' LIMIT 5;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
5 rows affected.

[('Ara Celi',),
 ('Aramis Knight',),
 ('Arben Bajraktaraj',),
 ('Arcelia Ramírez',),
 ('Archie Kao',)]

___

In [171]:
%%sql
-- Get the names of all people whose names follow the pattern 'A_i' 
SELECT name FROM people
WHERE name LIKE 'A_i%' LIMIT 5;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
5 rows affected.

[('Abigail Evans',),
 ('Abigail Spencer',),
 ('Aditya Roy Kapoor',),
 ('Aki Aleong',),
 ('Aki Kaurismäki',)]

___

In [172]:
%%sql
-- Get the names of all people whose names don't start with A
SELECT name FROM people
WHERE name NOT LIKE 'A%' LIMIT 5;

 * postgresql://localhost/films
   postgresql://postgres:***@localhost/films
5 rows affected.

[('50 Cent',),
 ('Álex Angulo',),
 ('Álex de la Iglesia',),
 ('Ángela Molina',),
 ('B.J. Novak',)]